In [1]:
%load_ext sql

connecting to the database

In [2]:
%%sql

sqlite:///CourseData.db

'Connected: @CourseData.db'

We choose. Omari Ansong as our random Instructor ID to test our database, this will show us her information as an instructor.

In [4]:
%%sql

SELECT * FROM INSTRUCTOR WHERE IID = 89;

 * sqlite:///CourseData.db
Done.

[(89, 'Omari   Ansong')]

How many classes did Omari teach over the different semesters?

In [5]:
%%sql

SELECT DISTINCT Term, COUNT(*) FROM COURSE_OFFERINGS WHERE IID = 89 GROUP BY Term;

 * sqlite:///CourseData.db
Done.

[('Fall2014', 2),
 ('Fall2017', 1),
 ('Spring2015', 2),
 ('Spring2018', 1),
 ('Summer2017', 2),
 ('Summer2018', 2)]

Lets see if our database will show the different classes that Anita teaches. We will only show 15 to save some time.

In [7]:
%%sql

SELECT COID, CRN, CatalogID, Title, Term
FROM COURSE_OFFERINGS
WHERE IID = 89
LIMIT 15;

 * sqlite:///CourseData.db
Done.

[(433, 71499, 'CH 0111L', 'General Chemistry I Lab', 'Fall2014'),
 (443, 73221, 'CH 0111L', 'General Chemistry I Lab', 'Fall2014'),
 (9433, 71456, 'CH 0111L', 'General Chemistry I Lab', 'Fall2017'),
 (15453, 33048, 'CH 0222L', 'Chemical Analysis Lab', 'Spring2015'),
 (15455, 34090, 'CH 0222L', 'Chemical Analysis Lab', 'Spring2015'),
 (23893, 34565, 'CH 0112L', 'General Chemistry II Lab', 'Spring2018'),
 (30587, 57365, 'CH 0211L', 'Organic Chemistry I Lab', 'Summer2017'),
 (30591, 57367, 'CH 0212L', 'Organic Chemistry II Lab', 'Summer2017'),
 (31169, 58223, 'CH 0211L', 'Organic Chemistry I Lab', 'Summer2018'),
 (31173, 58225, 'CH 0212L', 'Organic Chemistry II Lab', 'Summer2018')]

Omari taugt 10 classes during his time from Fall 2014 to Summer 2018.

In [10]:
%%sql

SELECT COUNT (DISTINCT CRN) AS Classes FROM COURSE_OFFERINGS JOIN COURSE_MEETINGS USING (CRN) WHERE IID = 89;

 * sqlite:///CourseData.db
Done.

[(10,)]

Omari is a Chemestry teacher, so his classes would mostly be in Bannow as we see below.

In [11]:
%%sql

SELECT DISTINCT Location, COUNT(*)
FROM LOCATION l
INNER JOIN COURSE_MEETINGS m ON l.LID=m.LID
INNER JOIN COURSE_OFFERINGS z ON m.CRN=z.CRN
WHERE IID = 89
GROUP BY Location;

 * sqlite:///CourseData.db
Done.

[('BNW 339', 58),
 ('BNW 341', 26),
 ('BNW 361', 40),
 ('BNW 362', 13),
 ('BNW 363', 26),
 ('BNW GR22', 27),
 ('CMC ', 14)]

We can conclude that Omari Ansong is a Chemestry teacher and teaches his classes in Bannow, and teaches 10 different classes over the corse of 4 years.